app/views/users/edit.html.erb

	<h1>Update <%= @user.email %></h1>
	<h2>Avaliable roles <%= @user.roles.pluck(:name).join(', ')%></h2>
---
SELECT "roles"."name" FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ?  [["user_id", 1]]

		<%= form_with model: @user do |form| %>
		<%= select_tag "roles", options_from_collection_for_select(Role.all, "id", "name"), {prompt: 'Select a Role', class: 'form-control'} %>
---
SELECT "roles".* FROM "roles"

		<%= form_with model: @user do |form| %>
		<%= select_tag "roles", options_from_collection_for_select(Role.all, "id", "name"), {prompt: 'Select a Role', class: 'form-control'} %>
---
SELECT "roles".* FROM "roles"