app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Project Nitesh"], ["created_at", "2023-05-23 08:34:41.257057"], ["updated_at", "2023-05-23 08:34:41.257057"]]
---
  def create
   @project = Project.new(project_params)
    if @project.save

UPDATE "projects" SET "name" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "Project Nitesh2"], ["updated_at", "2023-05-23 11:52:49.565724"], ["id", 2]]
---
  def update
    authorize @project
    @project.update(project_params)

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def current_project
    @project = Project.find(params[:id])