app/controllers/users_controller.rb

  def update
    #authorize @user
    role = Role.find params[:roles]
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def current_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]